In [18]:

mi_dicccionario = {'nombre':'Carolina',
                   'edad': 30,
                    'licencia': True,
                     'deportes':['correr','bicicleta']}
mi_dicccionario

{'nombre': 'Carolina',
 'edad': 30,
 'licencia': True,
 'deportes': ['correr', 'bicicleta']}

In [19]:
mi_dicccionario2 = dict(nombre = 'Carolina',
                        edad = '30',
                        licencia = 'True')
mi_dicccionario2

{'nombre': 'Carolina', 'edad': '30', 'licencia': 'True'}

In [20]:
mi_dicccionario['nombre']

'Carolina'

In [21]:
mi_dicccionario.get('nombre')

'Carolina'

In [22]:
mi_dicccionario.keys()

dict_keys(['nombre', 'edad', 'licencia', 'deportes'])

In [23]:
mi_dicccionario.values()

dict_values(['Carolina', 30, True, ['correr', 'bicicleta']])

In [24]:
mi_dicccionario['edad'] = 30
mi_dicccionario

{'nombre': 'Carolina',
 'edad': 30,
 'licencia': True,
 'deportes': ['correr', 'bicicleta']}

In [25]:
mi_dicccionario['eduacaion'] = 'universidad'
mi_dicccionario

{'nombre': 'Carolina',
 'edad': 30,
 'licencia': True,
 'deportes': ['correr', 'bicicleta'],
 'eduacaion': 'universidad'}

In [26]:
for llave in mi_dicccionario.values():
    print(llave)

Carolina
30
True
['correr', 'bicicleta']
universidad

In [50]:
# Dostipos de bucles for, if
for llave in mi_dicccionario:
    if llave == 'edad':
       print(llave, mi_dicccionario[llave])

edad 30

In [51]:
#se utlizo el comando pop
mi_dicccionario.pop('edad')

30

In [55]:
# Dostipos de bucles for, if
for llave in mi_dicccionario:
    if llave == 'nombre':
       print(llave, mi_dicccionario[llave])

nombre Carolina

In [56]:
# Dostipos de bucles for, if
for llave in mi_dicccionario:
    if llave == 'deportes':
       print(llave, mi_dicccionario[llave])

deportes ['correr', 'bicicleta']

In [27]:
for llave in mi_dicccionario:
    print(mi_dicccionario[llave])

Carolina
30
True
['correr', 'bicicleta']
universidad

In [28]:
mi_dicccionario

{'nombre': 'Carolina',
 'edad': 30,
 'licencia': True,
 'deportes': ['correr', 'bicicleta'],
 'eduacaion': 'universidad'}

In [33]:
mi_dicccionario2 = dict(nombre1 = 'Carolina',
                    edad = 30,
                    licencia = True,
                    nombre2 = 'Jairo')
mi_dicccionario2

{'nombre1': 'Carolina', 'edad': 30, 'licencia': True, 'nombre2': 'Jairo'}

In [46]:
clase ={'estudiante1':{'nombre':'Carolina','edad':'30'},
        'estudiante2' :{'nombre':'Jairo', 'edad': '33'}}

In [47]:
clase

{'estudiante1': {'nombre': 'Carolina', 'edad': '30'},
 'estudiante2': {'nombre': 'Jairo', 'edad': '33'}}

In [48]:
clase['estudiante1']['nombre']

'Carolina'

In [57]:
clase['estudiante2']['nombre']

'Jairo'

In [59]:
import pandas as pd

In [68]:
#Los corchetes defienen una lista
{'nombres':['Carolina','Jairo','Jefferson'],
 'edades':[30,33,36]}

{'nombres': ['Carolina', 'Jairo', 'Jefferson'], 'edades': [30, 33, 36]}

In [115]:
# Realizar un DataFrame
pd.DataFrame({'nombres':['Carolina','Jairo','Jefferson'],
              'edades':['30','33','36']})

     nombres edades
0   Carolina     30
1      Jairo     33
2  Jefferson     36

In [116]:
#con mi dicccionario
midic = {'nombres':['Carolina','Jairo','Jefferson'],
              'edades':['30','33','36']}
midic

{'nombres': ['Carolina', 'Jairo', 'Jefferson'], 'edades': ['30', '33', '36']}

In [117]:
pd.DataFrame(midic)

     nombres edades
0   Carolina     30
1      Jairo     33
2  Jefferson     36

In [118]:
midic ['educacion'] = {'Diplomado','Posgrado','Universidad'}
midic

{'nombres': ['Carolina', 'Jairo', 'Jefferson'],
 'edades': ['30', '33', '36'],
 'educacion': {'Diplomado', 'Posgrado', 'Universidad'}}

In [84]:
midic

{'nombres': ['Carolina', 'Jairo', 'Jefferson'],
 'edades': ['30', '33', '36'],
 'educacion': {'Diplomado', 'Posgrado', 'Universidad'}}

In [106]:
import numpy as np

In [119]:
# ponen en nulo es np.nan
midic ['educacion']= ['Diplomado','Posgrado', np.nan]

In [120]:
mi_df = pd.DataFrame(midic)
mi_df

     nombres edades  educacion
0   Carolina     30  Diplomado
1      Jairo     33   Posgrado
2  Jefferson     36        NaN

In [122]:
# se utlizo el comando insnull typo de datos boleanos nos imprime
mi_df['educacion'].isnull()

0    False
1    False
2     True
Name: educacion, dtype: bool

In [125]:
mi_df['nombres'][1]

'Jairo'

In [126]:
mi_df['nombres'][1:3]

1        Jairo
2    Jefferson
Name: nombres, dtype: object

In [129]:
# comando iloc muestra la tabla
mi_df.iloc[1:3 , 0:2]

     nombres edades
1      Jairo     33
2  Jefferson     36

In [130]:
# columna uno fila dos
mi_df.iloc[1:2]

  nombres edades educacion
1   Jairo     33  Posgrado

In [132]:
#cuando se utliza corchetes y en separacion hay una coma al imprimir muestra en nombre
mi_df.iloc[1,0]

'Jairo'

In [133]:
mi_df.iloc[1:2,0:2]

  nombres edades
1   Jairo     33

In [134]:
mi_df.iloc[1,1:3]

edades             33
educacion    Posgrado
Name: 1, dtype: object